# Data Input and Output
* #### CSV
* #### Excel
* #### HTML
* #### SQL

In [1]:
import pandas as pd

In [2]:
pwd

'D:\\Udemy\\DataScience\\DataScience\\03_Python_for_Data_Analysis_Pandas'

# CSV

In [5]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df = pd.read_csv('example.csv')

In [12]:
df.to_csv('My_output.csv')

In [13]:
pd.read_csv('My_output.csv')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_csv('My_output.csv', index=False)

In [15]:
pd.read_csv('My_output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# Excel

In [19]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [20]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1', index_col=0)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [21]:
df = pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1', index_col=0)

In [22]:
df.to_excel('My_output.xlsx', sheet_name='NewSheet', index=False)

In [23]:
pd.read_excel('My_output.xlsx', sheet_name='NewSheet')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# HTML 
* #### Link: http://www.fdic.gov/bank/individual/failed/banklist.html
* #### Link: https://www.w3schools.com/html/html_tables.asp

In [25]:
data = pd.read_html('https://www.w3schools.com/html/html_tables.asp')

In [26]:
type(data)

list

In [30]:
len(data)

2

In [31]:
data[0].head()

                        Company          Contact  Country
0           Alfreds Futterkiste     Maria Anders  Germany
1    Centro comercial Moctezuma  Francisco Chang   Mexico
2                  Ernst Handel    Roland Mendel  Austria
3                Island Trading    Helen Bennett       UK
4  Laughing Bacchus Winecellars  Yoshi Tannamuri   Canada

# SQL

In [34]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')
df.to_sql('my_table', engine)
sqldf = pd.read_sql('my_table', con=engine)
sqldf

AttributeError: 'OptionEngine' object has no attribute 'execute'